In [1]:
import pandas as pd

sr = pd.Series([100, 200, 300, 400])
sr.index = ['A', 'B', 'O', 'AB']
sr

A     100
B     200
O     300
AB    400
dtype: int64

In [2]:
sr1 = pd.Series([10, 20, 30])
sr1

0    10
1    20
2    30
dtype: int64

In [3]:
df = pd.DataFrame({'키':[170, 180, 175], '몸무게':[65, 78, 70]})
df.index = ['스파이더맨', '닥터스트레인지', '아이언맨']
df

           키  몸무게
스파이더맨    170   65
닥터스트레인지  180   78
아이언맨     175   70

In [58]:
df = pd.read_csv('scores.csv', encoding='cp949')
df

        이름     국어   영어     수학
0     tony  100.0   90   95.0
1      sam   90.0   80   75.0
2   vision   95.0  100  100.0
3    peter  100.0  100  100.0
4    scott    NaN   35   60.0
5      tor   70.0   75   65.0
6    bruce   80.0   90   55.0
7     thor   50.0   60    NaN
8  steaven  100.0  100   90.0
9    wanda   90.0   95   70.0

In [45]:
df.head()

           키  몸무게
스파이더맨    170   65
닥터스트레인지  180   78
아이언맨     175   70

In [7]:
df.tail()

           키  몸무게
스파이더맨    170   65
닥터스트레인지  180   78
아이언맨     175   70

In [8]:
df.sample(3)

           키  몸무게
닥터스트레인지  180   78
스파이더맨    170   65
아이언맨     175   70

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 스파이더맨 to 아이언맨
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   키       3 non-null      int64
 1   몸무게     3 non-null      int64
dtypes: int64(2)
memory usage: 72.0+ bytes

In [10]:
df.shape

(3, 2)

In [11]:
len(df)

3

In [12]:
df.isnull().sum()

키      0
몸무게    0
dtype: int64

In [13]:
df_dropna = df.dropna()
df_dropna

           키  몸무게
스파이더맨    170   65
닥터스트레인지  180   78
아이언맨     175   70

In [14]:
df_fillna = df.fillna(50)
df_fillna

           키  몸무게
스파이더맨    170   65
닥터스트레인지  180   78
아이언맨     175   70

In [15]:
df.describe()

           키        몸무게
count    3.0   3.000000
mean   175.0  71.000000
std      5.0   6.557439
min    170.0  65.000000
25%    172.5  67.500000
50%    175.0  70.000000
75%    177.5  74.000000
max    180.0  78.000000

In [59]:
df['국어'].sum()

775.0

In [60]:
df.value_counts('영어')

영어
100    3
90     2
35     1
60     1
75     1
80     1
95     1
dtype: int64

In [61]:
df['국어']

0    100.0
1     90.0
2     95.0
3    100.0
4      NaN
5     70.0
6     80.0
7     50.0
8    100.0
9     90.0
Name: 국어, dtype: float64

In [62]:
df[['국어', '영어']]

      국어   영어
0  100.0   90
1   90.0   80
2   95.0  100
3  100.0  100
4    NaN   35
5   70.0   75
6   80.0   90
7   50.0   60
8  100.0  100
9   90.0   95

In [63]:
df.loc[1]

이름     sam
국어    90.0
영어      80
수학    75.0
Name: 1, dtype: object

In [64]:
df.loc[[1,2,3]]

       이름     국어   영어     수학
1     sam   90.0   80   75.0
2  vision   95.0  100  100.0
3   peter  100.0  100  100.0

In [22]:
df.iloc[2]

키      175
몸무게     70
Name: 아이언맨, dtype: int64

In [23]:
df.iloc[2:5]

        키  몸무게
아이언맨  175   70

In [65]:
# 시퀀스가 아니라 인덱스로 추출
df.loc[2:5]

       이름     국어   영어     수학
2  vision   95.0  100  100.0
3   peter  100.0  100  100.0
4   scott    NaN   35   60.0
5     tor   70.0   75   65.0

In [25]:
df

           키  몸무게
스파이더맨    170   65
닥터스트레인지  180   78
아이언맨     175   70

In [66]:
df.iloc[1,3]

75.0

In [27]:
df.iloc[1:3, 1:3]

         몸무게
닥터스트레인지   78
아이언맨      70